<?php
// +----------------------------------------------------------------------
// | 小矮人 [基于ThinkPHP5开发]
// +----------------------------------------------------------------------
// | Copyright (c) http://blog.csdn.net/lz610756247
// +----------------------------------------------------------------------
// | Author: 曹瑞
// +----------------------------------------------------------------------
// [  ]
//2017/11/27 17:33
namespace app\common\model;

use app\common\model\Model;

class CarInfo extends Model{
    //设置数据表（不含前缀)
    protected $name = 'car_info';
    // 数据表主键 复合主键使用数组定义 不设置则自动获取
    protected $pk = 'car_id';
}