<?php
// +----------------------------------------------------------------------
// | [基于ThinkPHP5开发]
// +----------------------------------------------------------------------
// | Copyright (c) http://blog.csdn.net/lz610756247
// +----------------------------------------------------------------------
// | Author: 曹瑞
// +----------------------------------------------------------------------
// [ 流水表 ]
//2017/11/30 16:04
namespace app\common\model;

use app\common\model\Model;

class ShopAccount extends Model{
    //设置数据表（不含前缀)
    protected $name = 'shop_account';
    // 数据表主键 复合主键使用数组定义 不设置则自动获取
    protected $pk = 'acc_id';
}